Конфигурации/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕстьСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурации/Catalogs/Пользователи/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)	
		
		УИД = ЭтотОбъект.Ссылка.УникальныйИдентификатор();
		Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УИД);
		Если Пользователь = Неопределено Тогда			
			НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();		
			НовыйПользователь.Имя = ЭтотОбъект.Наименование;
			НовыйПользователь.Имя = Наименование;
			Если Не ПустаяСтрока(ПолноеНаименование) Тогда			
				НовыйПользователь.ПолноеИмя = ПолноеНаименование;
			Иначе
				НовыйПользователь.ПолноеИмя = Наименование;
			КонецЕсли;
			
			Если ДополнительныеСвойства.Свойство("СписокРолейМодифицированность") И ДополнительныеСвойства.Свойство("СписокРолей") Тогда
				Если ДополнительныеСвойства.СписокРолейМодифицированность Тогда					
					Для Каждого Строка Из ЭтотОбъект.СписокРолей Цикл 
						Для Каждого Элемент Из ДополнительныеСвойства.СписокРолей Цикл
							Если Строка.РольСиноним = Элемент.Представление Тогда
								НовыйПользователь.Роли.Добавить(Метаданные.Роли.Найти(Элемент.Значение));
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					КонецЦикла;;
				КонецЕсли;
			КонецЕсли;
			
			НовыйПользователь.Записать();
			НоваяСсылка = Справочники.Пользователи.ПолучитьСсылку(НовыйПользователь.УникальныйИдентификатор);			
			ЭтотОбъект.УстановитьСсылкуНового(НоваяСсылка);		
		ИначеЕсли ДополнительныеСвойства.Свойство("Модифицированность") Тогда
			
			Пользователь.Имя = Наименование;
			Пользователь.ПолноеИмя = Наименование;
			
			Если ДополнительныеСвойства.Свойство("СписокРолейМодифицированность") И ДополнительныеСвойства.Свойство("СписокРолей") Тогда
				Если ДополнительныеСвойства.СписокРолейМодифицированность Тогда					
					Для Каждого Строка Из ЭтотОбъект.СписокРолей Цикл 
						Для Каждого Элемент Из ДополнительныеСвойства.СписокРолей Цикл
							Если Строка.РольСиноним = Элемент.Представление Тогда
								Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Элемент.Значение));
								Прервать;
							КонецЕсли;
						КонецЦикла;	
					КонецЦикла;;
				КонецЕсли;
			КонецЕсли;
			Пользователь.Записать();
		КонецЕсли;			
	
	КонецПроцедуры
